# IPython SQL

`ipython-sql` is an IPython extension that allows the user to use SQL within IPython and Jupyter.

It utilizes SQLAlchemy under the hood and most (all?) of the magic functions included in the package can be mimicked with more explicit SQLAlchemy (but who has time for that)

**Load extenstion**

In [ ]:
%load_ext sql

## Create a database

In [ ]:
%sql sqlite:///test.db
#%sql mysql://test.db
#%sql presto://test.db
# other Engines compatible with SQLAlchemy

In [ ]:
%%sql
DROP TABLE IF EXISTS test_tbl;
CREATE TABLE IF NOT EXISTS test_tbl (col_nul, col_int, col_flt, col_str);
INSERT INTO test_tbl
VALUES (NULL, 1, 1.5, 'A'),
       (NULL, 2, 2.5, 'B'),
       (NULL, 3, 3.5, 'B'),
       (NULL, 4, 3.5, 'C'),
       (NULL, 5, 4.5, 'C');
SELECT * FROM test_tbl;

## Disconnect a database

## Load a database

In [ ]:
#%sql sqlite:///my_database.db

## Run SQL Commands

In [ ]:
%sql SELECT * FROM test_tbl

Assigning variable to output

In [ ]:
result_set = %sql SELECT * FROM test_tbl

In [ ]:
%%sql result_set << 
SELECT * 
FROM test_tbl

## Format and Type Conversions

**Converting SQL Table into Pandas DataFrame**

In [ ]:
import pandas as pd

Approach 1

In [ ]:
result_set = %sql SELECT * FROM test_tbl
df = result_set.DataFrame()

#print(type(result_set) == sql.run.ResultSet)
assert(type(df) == pd.core.frame.DataFrame)

Approach 2

In [ ]:
%%sql
SELECT * FROM test_tbl;

In [ ]:
result_set = _ # '_' refers to output of most recently run cell
df = result_set.DataFrame()

assert(type(df) == pd.core.frame.DataFrame)

**Convert Pandas DataFrame into SQL Table**

In [ ]:
my_df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['A','B','C'])
# safety check
%sql DROP TABLE IF EXISTS my_df;
# conversion
%sql PERSIST my_df;

In [ ]:
%sql SELECT * FROM my_df

# TESTING

In [ ]:
%%sql
DROP TABLE IF EXISTS my_table;
CREATE TABLE IF NOT EXISTS my_table (col_int INTEGER, col_flt REAL, col_str TEXT, col_date TEXT);
INSERT INTO my_table
VALUES (1, 1.4, 'A', '2020-12-30'),
       (2, 2.9, 'B', '2020-01-10');
SELECT * FROM my_table;

In [ ]:
%%sql 
--ALTER TABLE my_table DROP COLUMN col_date2;
--ALTER TABLE my_table ADD COLUMN col_date2 DATE;
--INSERT INTO my_table(col_date2) SELECT DATE(col_date) FROM my_table;
ALTER TABLE my_table ADD COLUMN col_date2 DATE SELECT DATE(col_date) FROM my_table;
SELECT * FROM my_table;

In [ ]:
%sql SELECT * FROM my_table;